In [1]:
import numpy as np
import pandas as pd

from pandas import Series, DataFrame

# Series

In [2]:
obj = pd.Series([3,6,9,12])
obj

0     3
1     6
2     9
3    12
dtype: int64

In [3]:
obj.values

array([ 3,  6,  9, 12])

In [4]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
ww2_cas = pd.Series([870000, 430000, 300000, 210000, 400000], index=['USSR','Germany','China','Japan','USA'])

ww2_cas

USSR       870000
Germany    430000
China      300000
Japan      210000
USA        400000
dtype: int64

In [6]:
ww2_cas['USA']

400000

In [7]:
ww2_dict = ww2_cas.to_dict()
ww2_dict

{'USSR': 870000,
 'Germany': 430000,
 'China': 300000,
 'Japan': 210000,
 'USA': 400000}

# Reindex

In [11]:
ww2_cas_ri = ww2_cas.reindex(['USSR','Germany','China','Japan','USA', 'a'])
ww2_cas_ri

USSR       870000.0
Germany    430000.0
China      300000.0
Japan      210000.0
USA        400000.0
a               NaN
dtype: float64

In [12]:
ww2_cas_ri = ww2_cas.reindex(['USSR','Germany','China','Japan','USA', 'a'], fill_value=0)
ww2_cas_ri

USSR       870000
Germany    430000
China      300000
Japan      210000
USA        400000
a               0
dtype: int64

In [13]:
ser3 = pd.Series(['USA', 'Mexico', 'Canada'], index=[0,5,10])

ranger = range(15)
ser3.reindex(ranger, method='ffill')

0        USA
1        USA
2        USA
3        USA
4        USA
5     Mexico
6     Mexico
7     Mexico
8     Mexico
9     Mexico
10    Canada
11    Canada
12    Canada
13    Canada
14    Canada
dtype: object

In [14]:
dframe = DataFrame(np.random.randn(25).reshape((5,5)), index=['A','B','D','E','F'],
                  columns=['col1', 'col2', 'col3', 'col4', 'col5'])

In [15]:
dframe

       col1      col2      col3      col4      col5
A  0.052654 -0.575062  0.426638 -0.926577  0.876821
B -1.069327  0.087378  1.366499  0.757098  1.331855
D  0.619839 -0.004826  2.140486 -0.650653  1.146620
E -0.197936 -0.377519  0.442284  1.962380 -1.450816
F -2.010784  1.449742 -0.704594 -0.045993  0.089714

In [17]:
dframe.reindex(columns=['col1', 'col2', 'col2.5','col3', 'col4', 'col5'])

       col1      col2  col2.5      col3      col4      col5
A  0.052654 -0.575062     NaN  0.426638 -0.926577  0.876821
B -1.069327  0.087378     NaN  1.366499  0.757098  1.331855
D  0.619839 -0.004826     NaN  2.140486 -0.650653  1.146620
E -0.197936 -0.377519     NaN  0.442284  1.962380 -1.450816
F -2.010784  1.449742     NaN -0.704594 -0.045993  0.089714

# Combining

In [18]:
ser1 = pd.Series([2, np.nan, 4, np.nan, 6, np.nan],
                index=['Q','R','S','T','U','V'])
ser1

Q    2.0
R    NaN
S    4.0
T    NaN
U    6.0
V    NaN
dtype: float64

In [19]:
ser2 = pd.Series(np.arange(len(ser1)), dtype=np.float64,
                index=['Q','R','S','T','U','V'])

In [20]:
pd.Series(np.where(pd.isnull(ser1), ser2, ser1), index=ser1.index)

Q    2.0
R    1.0
S    4.0
T    3.0
U    6.0
V    5.0
dtype: float64

In [21]:
ser1.combine_first(ser2)

Q    2.0
R    1.0
S    4.0
T    3.0
U    6.0
V    5.0
dtype: float64

In [22]:
nan = np.nan
dframe_odds = DataFrame({'X':[1.,nan,3.,nan],
                        'Y':[nan,5.,nan,7.],
                        'Z':[nan,9.,nan,11]})

In [23]:
dframe_evens = DataFrame({'X':[2.,4.,nan,6.,8.],
                         'Y':[nan,10.,12.,14.,16.]})

In [24]:
dframe_odds

     X    Y     Z
0  1.0  NaN   NaN
1  NaN  5.0   9.0
2  3.0  NaN   NaN
3  NaN  7.0  11.0

In [25]:
dframe_evens

     X     Y
0  2.0   NaN
1  4.0  10.0
2  NaN  12.0
3  6.0  14.0
4  8.0  16.0

In [26]:
dframe_odds.combine_first(dframe_evens)

     X     Y     Z
0  1.0   NaN   NaN
1  4.0   5.0   9.0
2  3.0  12.0   NaN
3  6.0   7.0  11.0
4  8.0  16.0   NaN

# Mapping

In [27]:
dframe = pd.DataFrame({'city': ['Alma', 'Brian Head', 'Fox Park'],
                      'altitude': [3158, 3000, 2762]})

In [28]:
state_map = {'Alma': 'Colorad', 'Brian Head': 'Utah', 'Fox Park': 'Wyoming'}
dframe['state'] = dframe['city'].map(state_map)

In [29]:
dframe

         city  altitude    state
0        Alma      3158  Colorad
1  Brian Head      3000     Utah
2    Fox Park      2762  Wyoming

# Replace

In [30]:
ser1 = pd.DataFrame([1,2,2,3,4])
ser1.replace(2, np.nan)

     0
0  1.0
1  NaN
2  NaN
3  3.0
4  4.0

In [32]:
ser1.replace({2:np.nan})

     0
0  1.0
1  NaN
2  NaN
3  3.0
4  4.0

# Rename Index

In [35]:
dframe.city.map(str.lower)

0          alma
1    brian head
2      fox park
Name: city, dtype: object

In [37]:
dframe.rename(index={1:'A'})

         city  altitude    state
0        Alma      3158  Colorad
A  Brian Head      3000     Utah
2    Fox Park      2762  Wyoming